preq.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inf="http://infocomercial.cifin.asobancaria.com" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:dto="http://dto.infocomercial.cifin.asobancaria.com" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
  <soap-env:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
<SignedInfo>
<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<Reference URI="#id-4db28775-f20a-4e2b-82f0-55d8d40ee1f7">
<Transforms>
<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</Transforms>
<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<DigestValue>VEvU/vx8jSOwqrm7NdMX5tsZw0Y=</DigestValue>
</Reference>
<Reference URI="#id-713e3f14-7b62-451f-8cc8-3798a81d8553">
<Transforms>
<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</Transforms>
<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<DigestValue>vuHaxeAxUV8j49q9Z208B26ZPbE=</DigestValue>
</Reference>
</SignedInfo>
<SignatureValue>i+9tPxhHmz9lc1RMLNHLwJS0M9Sl5VVDzd+vE1wOCVs5AhGhoEUqMFm2kShHcbsD
SBzFX7wfyGMaM/lSo25CvHFk5Wyu5Pu7SCeLAhuYjywMe/a2GVhaefpCNIKsOyOy
tTJyRZvMCdfElnp0mUT3Q/iJ7Mgf9Y5tec6TJcQZVC5APhQiWPSkUb6hTpQmETBm
adX6VuLPmGuzjP29IElmxcw+4r2y6QMApF+hSpuEt61kH8fvXCCqZEyIBhrVAj0f
O5kRsaGUVjk9fRnNjrjIGpGiorH+faJ8uAwe8vApu3izEI3cbT+hvzJ9cATBrq7F
IIpJPxMbqrwqXs6ORfDf+hBHtOgEe22Li/XcGfSxNXg/4I2pGdxEwpRxnR30YowF
sr0cG3YnM7YQC2G2DJ7VZNdYUvo1rjOuYwmeGwD7uqRdN/XZSz2X/XI6+213Z74w
jQSRqBLEJTQdtkkywz0XYFQ05T8lFCnkJtz017peZA5lcQB9/cBmIKSebf7CozUe
LCKCxzvA+eOSHqQd+5yZVcBn3nxJZMLZpW6GzILokFmtQDW/QNEZ235BkfX4h8gY
Ww1nZeAZBRTc2giSu/2LE3WvyP3enwYEDi/zoegk0zXtG8Dj5FScOMKTM0zR0v/K
c2bTK7t6k+EIAodwLJbkz5DzmSpOlQ8UJk3f/7pxqz8=</SignatureValue>
<KeyInfo>
<wsse:SecurityTokenReference><X509Data>
<X509IssuerSerial>
<X509IssuerName>CN=*.crediscore.co</X509IssuerName>
<X509SerialNumber>701958465195975363928029716549400644846424809112</X509SerialNumber>
</X509IssuerSerial>
<X509Certificate>MIIFFTCCAv2gAwIBAgIUevTn/d/XbTqbj0M6Q93+sRYx3pgwDQYJKoZIhvcNAQEL
BQAwGjEYMBYGA1UEAwwPKi5jcmVkaXNjb3JlLmNvMB4XDTIyMDUxODE1NTAzMFoX
DTIzMDUxODE1NTAzMFowGjEYMBYGA1UEAwwPKi5jcmVkaXNjb3JlLmNvMIICIjAN
BgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAzcXCy8j6k16n9z+LLl1Yyu8MwxCj
DuOrWES37HVyuXiD53uEZaOXQFevx+MxWwM409+cfhZdiCdXTxa6wLkGSVvEORym
3W14a8/kmbV968/RTNVqQ1J7lgz6nh/wjDS9VDgKyJtYUex0BHmOX0hIXw9FUwpX
NKlxcvdr29CRvrbOX1lInFPhuQdHz8H5xxDpqPBWGuPret3K8x4q1apMgINmrqDd
MaBaTqV0mKIIyuPrC1APIpkhzZR/Vvn3NWvjm+NFp6GNx5BdT8XS88lAHO/Kqqji
lCVR2lLKCZ7pJsD8fJnEU50+a9yKc2uD6yC9rQlL31JSX14xCmPBy7JXCrDnBvxD
Z2OOHl2AMa6vMgKnxI+w4WFlDQNc6dL7joRH8UXQSQL6euV8vsh8rp4xmuJAR8In
dYoOv+XJm79PqqMHXQF18Ws51Tl7WhAtwkqnblxNCRTZ2sdbyq75t8cVo5e61glq
sxS3DZnP0Ir4h696AtNQIJJSWskJv+ded/kMVgaL1vECPiPnW/Xf9JFEOeWjUYJe
d+G+9DG4hUGYjbkmeuFGry+KQbU3u4XRzq62glLRC1SB4UQy8DKJLECPmaXQwfQy
jVjfXHJf5Y4BXv6Bu2fs4vx//aCrMQzt+BLrq57RZgtvNzP/0VvIWlHVtOzoG6ZU
F7fghBlhD/Q+dv0CAwEAAaNTMFEwHQYDVR0OBBYEFCmqokNlUI6Av/54p1MCIC8n
fdDPMB8GA1UdIwQYMBaAFCmqokNlUI6Av/54p1MCIC8nfdDPMA8GA1UdEwEB/wQF
MAMBAf8wDQYJKoZIhvcNAQELBQADggIBAAmvik7/83QNuvT7t9Rik+WltBa//5BE
8jcEEMnehVI5/lbQE2hn34OZ2OtBJxXEWJ6aa71cJo43IDJ0o5uv9i1tBO40mZNj
JKunJg19/2q4szJuXuCs4vRSmS6nV20s/MM8dv4bHSJdSmxeEsU7NTsWNtQOgXlQ
WWCz1m+b6OzzxJTwOQLbizMosvAjCRdt1MSGhU8UPXpZeQRHRLdHs8WaSk0j/fza
qqiOx7xN2/1aeZ+gnfa1CPCTq6DYCNyrInPzaDR3sV4f96VDTkZLBWFgCyL7IDJw
yI2bhuiUCWRBMXhIwtxPr1BXUZ+RHaSJkhBxSSLjRY5AXf7e0PIYs9gIjVmC4DJV
dd0KrJpTEFTs9e8o2B+m+z4n8uLFnafefZMyzcfRaQxJGoIF8dJpL2lT//1XOiD3
He5alf6uiyeOBmUOXBiitx4Nou6LrPNjFFc3dwXMJZ3Lh8SN80Pf6N7H3mpQFqrj
HrVDcUrOR3cDjObs6dTDv8pGjyNZ0KWstkcNQFEMKaz1fnf1Llu0WUZ8gyYwTi0A
DbyBLFzqT1u6gbmgVcW5hDy7RRHVYNyoUWH8vmbIqsveLkwHo1aqQemjZ8EUyjcx
KEZr7bZO6OzU9/ar1YMErsHd+kM+s3EmCNOtXsiyaxtnhuQBp4iRbw4aXFTsRr//
s7Wv+dyRKX3i</X509Certificate>
</X509Data>
</wsse:SecurityTokenReference></KeyInfo>
</Signature>
      <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-713e3f14-7b62-451f-8cc8-3798a81d8553">        <wsu:Created>2022-12-11T18:27:12Z</wsu:Created>
        <wsu:Expires>2022-12-11T21:27:12Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
  </soap-env:Header>
  <soap-env:Body xmlns:ns0="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" ns0:Id="id-4db28775-f20a-4e2b-82f0-55d8d40ee1f7">    
    <inf:consultaXml>
      <parametrosConsulta>
        <codigoInformacion>1855</codigoInformacion>
        <motivoConsulta>24</motivoConsulta>
        <numeroIdentificacion>37685317</numeroIdentificacion>
        <primerApellido>1</primerApellido>
        <tipoIdentificacion xsi:nil="true"/>
      </parametrosConsulta>
    </inf:consultaXml>
  </soap-env:Body>
</soap-env:Envelope>